---
kind: property
id: P:Autodesk.Revit.DB.Analysis.MEPAnalyticalNode.Id
source: html/c8885842-960b-2ab7-3279-a760a0005e75.htm
---
# Autodesk.Revit.DB.Analysis.MEPAnalyticalNode.Id Property

The identity used in the MEPAnalyticalSegment

## Syntax (C#)
```csharp
public int Id { get; }
```